HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxSmu_regdef.h
/** \\brief  Status Register */
typedef struct _Ifx_SMU_STS_Bits
{
    unsigned int CMD:4;                     /**< \brief [3:0] Last command received (rwh) */
    unsigned int ARG:4;                     /**< \brief [7:4] Last command argument received (rwh) */
    unsigned int RES:1;                     /**< \brief [8:8] Result of last received command (rwh) */
    unsigned int ASCE:1;                    /**< \brief [9:9] Alarm Status Clear Enable (rwh) */
    unsigned int FSP:2;                     /**< \brief [11:10] Fault Signaling Protocol status (rh) */
    unsigned int FSTS:1;                    /**< \brief [12:12] Fault State Timing Status (rwh) */
    unsigned int reserved_13:3;             /**< \brief \internal Reserved */
    unsigned int RTS0:1;                    /**< \brief [16:16] Recovery Timer 0 Status (rwh) */
    unsigned int RTME0:1;                   /**< \brief [17:17] Recovery Timer 0 Missed Event (rwh) */
    unsigned int RTS1:1;                    /**< \brief [18:18] Recovery Timer 1 Status (rwh) */
    unsigned int RTME1:1;                   /**< \brief [19:19] Recovery Timer 1 Missed Event (rwh) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_SMU_STS_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Smu_union
 * \{  */

/** \\brief  SMU Access Enable Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_ACCEN0_Bits B;
} Ifx_SMU_ACCEN0;

/** \\brief  SMU Access Enable Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_ACCEN1_Bits B;
} Ifx_SMU_ACCEN1;

/** \\brief  Alarm Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_AD_Bits B;
} Ifx_SMU_AD;

/** \\brief  Alarm and Fault Counter */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_AFCNT_Bits B;
} Ifx_SMU_AFCNT;

/** \\brief  Alarm Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_AG_Bits B;
} Ifx_SMU_AG;

/** \\brief  Alarm Global Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_AGC_Bits B;
} Ifx_SMU_AGC;

/** \\brief  Alarm Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_AGCF_Bits B;
} Ifx_SMU_AGCF;

/** \\brief  FSP Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_AGFSP_Bits B;
} Ifx_SMU_AGFSP;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_CLC_Bits B;
} Ifx_SMU_CLC;

/** \\brief  Command Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_CMD_Bits B;
} Ifx_SMU_CMD;

/** \\brief  Debug Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_DBG_Bits B;
} Ifx_SMU_DBG;

/** \\brief  Fault Signaling Protocol */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_FSP_Bits B;
} Ifx_SMU_FSP;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_ID_Bits B;
} Ifx_SMU_ID;

/** \\brief  Key Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_KEYS_Bits B;
} Ifx_SMU_KEYS;

/** \\brief  SMU Reset Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_KRST0_Bits B;
} Ifx_SMU_KRST0;

/** \\brief  SMU Reset Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_KRST1_Bits B;
} Ifx_SMU_KRST1;

/** \\brief  SMU Reset Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_KRSTCLR_Bits B;
} Ifx_SMU_KRSTCLR;

/** \\brief  OCDS Control and Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_OCS_Bits B;
} Ifx_SMU_OCS;

/** \\brief  Port Control */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_PCTL_Bits B;
} Ifx_SMU_PCTL;

/** \\brief  Register Monitor Control */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_RMCTL_Bits B;
} Ifx_SMU_RMCTL;

/** \\brief  Register Monitor Error Flags */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_RMEF_Bits B;
} Ifx_SMU_RMEF;

/** \\brief  Register Monitor Self Test Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_RMSTS_Bits B;
} Ifx_SMU_RMSTS;

/** \\brief  Recovery Timer Alarm Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_RTAC0_Bits B;
} Ifx_SMU_RTAC0;

/** \\brief  Recovery Timer Alarm Configuration */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_RTAC1_Bits B;
} Ifx_SMU_RTAC1;

/** \\brief  Fault Signaling Protocol */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_SMU_RTC_Bits B;
} Ifx_SMU_RTC;

